const express = require('express');
const cors = require('cors');
const router = require('./routes');


const app = express();

// Middlewares
app.use(cors());
app.use(express.json());


// Routes
app.use(router);
app.get('/health', (req, res) => res.status(200).json({ status: 'Ț̴̢̧̧̦̳̳̯͎͚̭̺͕̫̯̰̃̈́̉͊̀͊͑̅̉̌̓̓̀̀̓̑̉͑̕͝h̷̨̡̢̛̗̲̹͍͖̱̳̮͉̻̯͔̩̗̭̻̠͍̹͙̼̜̺̻͍̭̹̟̝̞̻̥̥̞̼̾̆̓͑͗͌̊̅͆̈́̓̈̓̈́̾̎̌͊̚͜͜͝ę̴̡̡̢̧̛̟̪͈͙̳̟̜̘̠̲̙̊̀̊͒͊̋̚̚͜ ̶̖̯̘̥͇͎͆͌͑́̆͝ͅw̶̡͖͖̳̮̻̜̱͓̞̏͆͛̅̓́̏̔̊͋̕͝͝͝h̵̢̢̨̧̧̡̛̛͙̬̫͖͎͙͚͇̝͚̤̱̭̝̰̣̟̗͖̹̬̟͎̻̪̦̖̮͚̺̝̥̯̏́̐́̀̀̃͒̍̆̇̓̍̊̿̒̓͂̂̐̅͂̃̐̽̆͌̈́͆͋́̀̽͘̕̕͝ͅͅe̶͙̝̾̂̀̒̒̔͑̓͆̂͂̊̌͐̋̓̿̉͛̄̔͑̑͒̄͛̏̕͘e̸̡̨̨̞͓̮̫̤͖̗̝̻̥͍̙̯̻̜̫͇͎̪̬͔͍̮͙̳̲̥̹̙̱̮͚͙̞͕̖̖̘͂̊̈́͌̂̍̏̈̀͗͆͊̀͌̚ͅl̷̨̨̧̛͓̣̗͓͚̥̖̪͖̳̰̠̭͕̺̝͕̓̈̀̃̍͛̋̊́͗̂̾̊̑́̿̓̈́̍̂͂͒̎̓͜͠͝b̷̧̤͎̣̥̜͈̦̪̫̻̝͔̤̭̩͋̂͑̌͋́͒̀̌̑͋͂́̃̕͘ą̸̡̡͓̱̹̺͓͇͉̪̣̟̤͍̙̤̜̰̱͙͓̟̞̼͍̯̹͍̙̬̦̙̼͔͔̩̹̪̝̤͈̋̽́̈́̓͊̃̃́̋͗̚͝ͅř̵̢̧̢̖͍̹̜̣̖̹̲̥̪̬͖̱͚̣̣͖̠̤̖̫r̴̨͙̤̖̳͉̣̝͕̘̣̠̞͍̮̬͓̜͇͔͙̈́̏͐̈́̄̆͂͗̈́̎͊̑͐̐̒̂͌̏̆̀͌̊̒̏̈̈́̀̾̈́̾̕͘͝͝ͅo̵̡̮̺̗̺̲̳͚̤͉̜̿͋̂͗̀͒͗̇̇̏̂̿͌̔́̈́̿̄̄̃̃̆̉̂͐̐́͑̉̈̚̕͝͠ẃ̸̡̢̨̫̭̮̘̹̳̪̪̰̮̮̺̲̠̫̻̻̭͕̥̝͙̩̓̂ ̷̧̢̨̢̢͉̱͉͙̳̣͓̬͉͎͖̻̪̯̼̞̲͇͎̬̯͖̙̙̯̮̠̲̭̞̭̣̼̝̙͂̽̀̀͌͋͗̂̃͆͗̈́͛̀̀͝ǐ̵̧̧̖̙̟̬̗̤̙͇̗͍̖̲̼̳̲̯̺̯̖̮̮͓͖͖̫͍̂̍̃̿̓̾͂́̉̂̾́̾͊̄͛̒̈̿͂̿̅̈́̌̏̍́̐͊́̕͘̚̚͝͝͝s̸̡̢̛̛͔͓̝̰̯̰̘͖̙͎̫͒̿̈͛͐̑̔͌͂̀́͌̾̾͛̉͗̽͒̆̄͋͘̚͝͝ ̴̧̬͈̘̬̻͑́̌͂̓̈́͊̍͊̂͆̿̊̅͛̿͝ḧ̷̢̨̡̛̦̯̯̜͉̝̤̭́̓̈́̿́͆̅̊̎̄͂̾̌̊̓̑́̇́̅͗̀̋͜͠ͅi̷͖͉̔̒̍̐͊͐͐̐̉̆̂͗͊̄̈́̎̍̄̽̄̂̽̈̕̚̕̚ḏ̶̨̺̣̰͎̘̪̥̝͔̞͗͛̄̏̐̅d̸̢̬͉̹̙̭̼̖̣͓̞͇̯͔̓͒̆͂́͐̔̄̈̑̑̍̄̿͌̈́͗̎̽̋́̉́̑̑̈̈́͑̾̾͑͊́͊̿̍͘̚͘͠ệ̵̢̨̨̘̠͓̗̥̩̰͈̖͉̖̦̗͈̬͕̬̤͖͖̗͇̖̭̣̱̰̳̼̭͖̩̭̟͓̞̼͎̊͗̀̓̒͆͗̈́̀̅̽́͛̈́́͆͑̕͠n̸̗̝̗̘̩̾̈́͘ͅ ̴̨̡̨̧͈̞̼͍̟̯͈͍͈̲͇̼͓̞̙̰͍͔̭͕̭͈̪̠̯̝̳̗̫̭̖̗̻̗̺̙͗̑͗̎͆͒͂͑̇͛̒̓̆̑͌̄̐̅̂̕͜ͅͅb̸̡̡̫͔̗̩̱͉̖͉̞̬̗͍̙̬͕͓̃̿͛̈́̆̍̀̌̃̅̀̐͋͑̿́͐̀͘̚͘̕͘̚ȩ̶͔̼̻͚̗̖̺̩̦͎̰̠̹̣̦͗̊̾̀̉̌̿̈̑̎̃́̆̀̈́͘̕̚̕͠͝n̷͔̝͈̙̎̏͗̃̌͌̿̌͜͝ͅe̷̡̧̢̺̹̮͍͙̠̰̰̜̪͕͓̹͖̥͙͈͚̘̝͈̜̗̣̝͕͙̦̦̩͍͖̟̰̹̺̯̯̳͑͑̄̓͑͆͊̈̏̆͂͊̓̈̾̍̐͊͒͒͊͆̄͘̚̕̚͜͜͝͝͠a̶̢̛̲̦̖̩͙͋͆͌̽͗͊̽̆̇̒͊͆̊͒͘͝͠͝ẗ̶̢̨̧̛͖̬̰͚͔̭̗͇͈̜̥͎͇͙̩͖̳̮͍̳̗̙̯̥̯̣̤́̔̀̈̃̏̅́͊͛̀̅̈́̊͐̄͌̎̾̎̈͗̏̇̑͌̎̒̃̒̕͘̕͜͝͝͝͝ͅḩ̷̨̖̘̻͈̠̱͔̝͕͇̩̳̳̥͙̱͔̩̦̫̹͔͔̮̹̬̣̬̽̔̾̃̍̑̉̏̂͒͒́̀́̀̌͌͛̐̎̐̈́̇̒̈́͊̀̑̊̅́̄̈́͘̚̚͘͘͘͜͝͠ ̶̨̧̡̢̛̤͈̭̲̹͚̣̺͔̪̻̥̹̗͉̙̦̩͇̬̯͚̩̠̬̂̌̏͊̎̎̃͊̓̎̄̾͑̀̈́̾̌́̉̓̎̒͐̒́̿̔͌̽̚̚̕͘͜͠͠ą̸̡̭̥̩͇̯̖̥͖͎̠͐͐̽̉̎͘͝ ̴̡̛͚͉͕̀̓̂́̓͌͘͘̚͝p̴̧̧̡͍̦̲͈͈͈̻͚̘̠̞͎͔̩̹͍̻̬̬̳̟̦͉̤̮̳̺͇̞̬͓̖̦̫̬͔̆̚͜͜į̸̧̧͙̼͙͙͙̝̜͇͉̣̱̣̖̠͎͉̪͇̦̼͍̳̤͉̖̲̣̘̿̏͒̂̀̀͌͂̉̓̓͘̚͝l̵̢̡̛̛̬̦̳̯̫͚̫̪̩͎̫̻̻̣̖̬̜̝̣̫͓̦̜͍̩̗̤̞͖͔̥̝̬̗̘̝͎̤͚̻̈͒̇̈́͂̋̅̾̏͆̏̀͋͒̌̍̀̓́̀͑͘͘e̴͓̫͎̔̑̀̑̇͌̈͑̀͐̆̊̾̂̆͗̐͌̚͠ ̷͍̖͇͙̯͍͈̘̥̼̺̩̘̯̦̪̱̈͊̐̍̇͂͑̋̑͋͝͝ơ̶̧̧̢̡͓͖̼̦̼̩͉̝̟̜̖͎̯̝̼͔̯͓͓̘͇͓̼̠̲͇͔͙͔̥̠̥̗͙̩̫̐̀̑͌̈̌̀͐͊̽̋͆̃̑̉͜͝͝f̵̡̡̢̛̛̛͔͔͙͍̮̦̥̘̯͈̳͓̪̹͈̱͓̝̤͉̗̱̟͍̣̹̊̉͑̓̒̇͂̒̍̅́̏̌̾̽̌̓̌̂́̑̈́̾̐̈́̾̃̽͘̚̕͠͝͝͝͝ͅ ̵̡̧̨̛̛̛̻̯̫͍͉͈͖̥̙̮̯̭͇̬̠̠̥͙͚̫͖͉͉̗̮͓͚͖̳͓̠͉͇̩̘̭̮͖̈́̃̽͌͆͑́̇̎͒̏̈͑́̓̅̈̊͑͊̋͘͘̕͜ͅͅb̴̡̧̧̨̨̛̮͇̭̘̹͕̲͕͕͚̰̱͉̣̹̣̞̮̻̦̺̙̘̘̟̝̠̥͍͖͙͓͉̺͈͖̹̞̃̈̌̏̌̽̂̅̏̏͊̈́́̕ļ̶̼͕͖̻͎̠̙̞̞̺̦̺̳̬̤̬̙̫̦̘̘̠͒́͂̓ͅͅơ̵̢̛̱̝̤̰̙͔͇͎̭̥̟͚̰̞͎̝͗̽̄̍̈́́̈́͌́̊̇̇̈́̂̏͌̾̿̀̂̇̎̆̈́̂̊̂̔̈́̍̇̊̽͗͘͘̚̚͠͝͝͝ó̴̘̲̥̪͉̦̦̹͙̘̘̣͔͇͌̈̓̎̀͆̏̊͑ḑ̸̡̨͚̖̲̥̜̯̮̤̜̱̫͕͔̱̣̮̻̹̘̹̲͈̋̏̏̓̅̒̊̓̂̽͑̃͘ ̸̢̼̤͖̱͙̝͉̰̘͍͎̞͉̭̬̝̀̇͗̎̍̒̓͌̒̊̓̄̍͒̇͊̕͘͘ą̶̨̢̗̣̜̜̯̮̗͖̣̞̻̦͈̼̌̋͂͑̊̆̾̃̓͊̎̿́̀͆̽̎̀̚͜͠ņ̷̢̢̨̛̙̖͈͇̬̳͍̥̖͔͇͚͚̘̙͉̣̬͇̮̪̞̖͙͍̎̅̿̇́̽̄̓͐͛̓͛̒̄͑͐̐̉͘̕̕͠͠͝ͅd̷̢̥͖̪̭͖̰̱̮́͒̎̃͐͑̄̆̌́̎͊͌͌̑̋́̎̓̈́̂̈̀̓̈́̒̇̈̊́̿̑͘͘͠͠ ̵̨̧̳̠̖̟̞̣̩̫̊̑̍̑̃͗͑̐̈́́̅͆̋͆̋͗̆̔͛̈́́͒͋̆̀̎̚͜͝͠͝w̴̧͖̰̣̘̦̼̟̤̠̫̝͓̩͕̩͉̫͚͇͇̠̫̣͖̹͎̜̙̦̍́͑̑̓̃̏͌͒̚͘͝i̶̧̡̡̖̫͈̤͓̼̩̦͔̳͖̩̰̦̥͎̝̩̯̟͔͚̲̯͐͒̅͛̈́͑͠ͅͅs̵̡̨̧̛̛͖̺̗͍̳̬̰̥̝̦͈̭̦̱͖̥̬͔͙̬̩̫̙̖̟͓̙̜͙͕̤̬̭̺̖̦̜̆̇̅́̇̈́̄́́̉̈́̈́̔̏̿́̌̿̑̾̉͐̎̇̑̑͛͋͑̋̽̒̓̏͐̏̌͘̕͝ͅd̶̛̞̍̐̄͑̾̏̒̒̏̃͗͋̂̓̒͌̈́̋͗̍͆̑͑̋̉̎̈́̇̈͋̈́̈́̍̚̕͘̕͘͝͝͝ơ̷̧̢̡̛͚̺̰̥̲̘̜̭͍m̶̧̧̧̙͚̼̼̺͇̲̜̻̥̟̻̣̹̞̻̖̦̙̺̜̥̰̬̙̿̐̈̌͛͌̌̓̈̑͋̚͝ͅ ̶̡̦͎̱̥̮̮͈̫̫͉̤͔̌̐̋̏̋͊̒͜<̷̢̨̧̛̤̼̥̗̩̯͈͍͈͎̣̪̥̰̗͖̳͕̙̪͇̝̞̖̯͚̣͕̲͕̻̞̻͙̻̗̦̣̍͒̈́̈́̉̆̐̅͑͌̒͌̃͌͊͆̓͛͛͒̈͛̓̽̐̀͒́̔͌̄̌̋̍̕͘͜͜͠͝͠͝͝ͅ3̶̧̢̺͈̞̳͓̳̼̳̘͙̠̣̻̩͖̳̞̗̓̐͛̾́̋̅̓͊͌͒̉̊͋̋̆̊͘̚ͅͅ' }));




module.exports = app;